Documents/РегистрацияСведенийОЗастрахованномЛицеФСС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>РегистрацияСведенийОЗастрахованномЛицеФСС</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СведенияОЗастрахованномЛицеФСС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СНИЛС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Доставлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоставкаИдентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоставкаТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрацияДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрацияИдентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрацияСтатус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Зарегистрирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрацияПротокол</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьНесоответствия</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НесоответствиеДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НесоответствиеИдентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НесоответствиеПротокол</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьОшибкиЛогическогоКонтроля</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОшибкиЛогическогоКонтроля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияДокументаСЭДОФСС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Страхователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЗастрахованныеЛицаСЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ЗастрахованныеЛицаСЭДО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НаОформлении</Name>
					<Comment>Быстрый отбор для формы рабочего места. Заполняется в процедуре ПередЗаписью.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КОтправке</Name>
					<Comment>Быстрый отбор для формы рабочего места. Заполняется в процедуре ПередЗаписью.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВРаботе</Name>
					<Comment>Быстрый отбор для формы рабочего места. Заполняется в процедуре ПередЗаписью.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребуетсяСоздать</Name>
					<Comment>Заполняется на основании даты приема нового сотрудника. См. процедуру ДобавитьСведенияОНовыхСотрудниках модуля менеджера этого регистра.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребуетсяАктуализировать</Name>
					<Comment>Заполняется из кадровых данных. См. регистр ОчередьОбработкиКадровыхДанныхФСС.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоляТребующиеАктуализации</Name>
					<Comment>Заполняется из кадровых данных. См. регистр ОчередьОбработкиКадровыхДанныхФСС.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаксимальнаяДатаОтправки</Name>
					<Comment>Заполняется при изменении кадровых данных. См. регистр ОчередьОбработкиКадровыхДанныхФСС.</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоследниеСведения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СведенияОЗастрахованномЛицеФСС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СостояниеСведений</Name>
					<Comment>Состояние последних сведений.</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияДокументаСЭДОФСС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтправленныеСведения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СведенияОЗастрахованномЛицеФСС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РегистрацияСведений</Name>
					<Comment>Регистрация отправленных сведений.</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.РегистрацияСведенийОЗастрахованномЛицеФСС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СостояниеОтправки</Name>
					<Comment>Состояние отправленных сведений.</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияДокументаСЭДОФСС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Comment>Дата отправки отправленных сведений.</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Скрыть</Name>
					<Comment>Включается по кнопке "Не планируется отправлять (скрыть)" списка.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСкрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФИО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоВходящихДокументов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Несоответствие</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НесоответствиеСведенийОЗастрахованномЛицеСЭДО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НесоответствиеСотрудникНеЧислится</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребуетсяАннулировать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СНИЛС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Страхователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/РегистрацияСведенийОЗастрахованномЛицеФСС/Ext/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2020, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.Печать

// Заполняет список команд печати.
// 
// Параметры:
//  КомандыПечати - см. УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной
//                                                            параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной
//                                            параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтение
	|ГДЕ
	|	ЧтениеОбъектаРазрешено(ДокументОснование)
	|;
	|РазрешитьИзменениеЕслиРазрешеноЧтение
	|ГДЕ
	|	ИзменениеОбъектаРазрешено(ДокументОснование)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

#Область СоставДокументов

// Возвращает описание состава документа
//
// Возвращаемое значение:
//  Структура - см. ЗарплатаКадрыСоставДокументов.НовоеОписаниеСоставаОбъекта.
//
Функция ОписаниеСоставаОбъекта() Экспорт
	Возврат ЗарплатаКадрыСоставДокументов.ОписаниеСоставаОбъектаФизическоеЛицоВШапке("ФизическоеЛицо", "");
КонецФункции

#КонецОбласти

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

#Область СЭДО

// Загружает ошибку логического контроля регистрации сведений о застрахованном лице.
Процедура ЗагрузитьОшибкуСообщения86(Страхователь, ИдентификаторСообщения, ТекстОшибки, Результат) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	ГоловнаяОрганизация = ЗарплатаКадры.ГоловнаяОрганизация(Страхователь);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РегистрацияСведенийОЗастрахованномЛицеФСС.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РегистрацияСведенийОЗастрахованномЛицеФСС КАК РегистрацияСведенийОЗастрахованномЛицеФСС
	|ГДЕ
	|	РегистрацияСведенийОЗастрахованномЛицеФСС.ДоставкаИдентификатор = &ИдентификаторСообщения
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РегистрацияСведенийОЗастрахованномЛицеФСС.Ссылка
	|ИЗ
	|	Документ.РегистрацияСведенийОЗастрахованномЛицеФСС КАК РегистрацияСведенийОЗастрахованномЛицеФСС
	|ГДЕ
	|	РегистрацияСведенийОЗастрахованномЛицеФСС.РегистрацияИдентификатор = &ИдентификаторСообщения";
	Запрос.УстановитьПараметр("ИдентификаторСообщения", ИдентификаторСообщения);
	Запрос.УстановитьПараметр("ГоловнаяОрганизация", ГоловнаяОрганизация);
	
	ТекстОшибки = СокрЛП(ТекстОшибки);
	Добавка = Символы.ПС + Символы.ПС + НСтр("ru = 'Ошибка логического контроля: '") + СокрЛ(ТекстОшибки);
	
	Таблица = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаТаблицы Из Таблица Цикл
		Объект = СтрокаТаблицы.Ссылка.ПолучитьОбъект();
		Если СтрНайти(Объект.ОшибкиЛогическогоКонтроля, ТекстОшибки) = 0 Тогда
			Если ПустаяСтрока(Объект.ОшибкиЛогическогоКонтроля) Тогда
				Объект.ОшибкиЛогическогоКонтроля = ТекстОшибки;
			Иначе
				Объект.ОшибкиЛогическогоКонтроля = Объект.ОшибкиЛогическогоКонтроля + Символы.ПС + Символы.ПС + ТекстОшибки;
			КонецЕсли;
		КонецЕсли;
		Объект.ЕстьОшибкиЛогическогоКонтроля = Истина;
		СЭДОФСС.ЗаписатьДокумент(Объект, Истина, "БЗК", РежимЗаписиДокумента.ОтменаПроведения);
	КонецЦикла;
	
КонецПроцедуры

// Загружает результат регистрации сведений о застрахованном лице в базу данных.
Процедура ЗагрузитьСообщение87(Страхователь, ИдентификаторСообщения, ТекстXML, Результат, Кэш) Экспорт
	// Примера нет, ожидаемые поля: snils, status(enumeration), protocol[item[mnemonic,level,text,description]].
	// Поиск корневого узла.
	ОбъектXDTO = ОбъектXDTOПоСНИЛС(ТекстXML, Результат, ИдентификаторСообщения);
	Если ОбъектXDTO = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Чтение реквизитов.
	ДатаСообщения   = СЭДОФСС.ДатаСообщения(ИдентификаторСообщения, Кэш);
	СНИЛС           = СЭДОФСС.СНИЛСИзXML(ОбщегоНазначенияБЗК.ЗначениеСвойства(ОбъектXDTO, "snils"));
	Статус          = СериализацияБЗК.СтроковыйРеквизитОбъекта(ОбъектXDTO, "status");
	Протокол        = СериализацияБЗК.СписокXDTO(ОбъектXDTO, "protocol.item");
	ПредставлениеПротокола = ПредставлениеПротокола(Протокол);
	СведенияОСтатусе       = СведенияОСтатусеРегистрации(Статус);
	
	Если ЗначениеЗаполнено(Статус) И СведенияОСтатусе.Расшифровка = "" Тогда
		Текст = СтрШаблон(НСтр("ru = 'Неизвестный статус: ""%1"".'"), Статус);
		ПредставлениеПротокола = Текст + Символы.ПС + ПредставлениеПротокола;
	КонецЕсли;
	
	ДоставкаИдентификатор = СериализацияБЗК.СтроковыйРеквизитОбъекта(ОбъектXDTO, "responseOn");
	
	// Поиск и создание документа.
	ТекстОшибки = "";
	Объект = СоздатьДокументПоСообщению(СНИЛС, Страхователь, ТекстОшибки, ДоставкаИдентификатор, ДатаСообщения, "Регистрация", ИдентификаторСообщения);
	Если Объект = Неопределено Тогда
		Если ЗначениеЗаполнено(ТекстОшибки) Тогда
			СЭДОФСС.ОшибкаОбработки(Результат, ТекстОшибки);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.РегистрацияСтатус) Тогда
		СведенияОСтатусеОбъекта = СведенияОСтатусеРегистрации(Объект.РегистрацияСтатус);
		Если СведенияОСтатусе.Приоритет < СведенияОСтатусеОбъекта.Приоритет Тогда
			Возврат; // Неактуальный (старый) статус.
		КонецЕсли;
	КонецЕсли;
	
	// Заполнение документа.
	Объект.Зарегистрирован          = СведенияОСтатусе.Зарегистрирован;
	Объект.РегистрацияДата          = ДатаСообщения;
	Объект.РегистрацияСтатус        = Статус;
	Объект.РегистрацияПротокол      = ПредставлениеПротокола;
	Объект.РегистрацияИдентификатор = ИдентификаторСообщения;
	Если Объект.Зарегистрирован Тогда
		РежимЗаписи = РежимЗаписиДокумента.Проведение;
	Иначе
		РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения;
	КонецЕсли;
	СЭДОФСС.ЗаписатьДокумент(Объект, Истина, "БЗК", РежимЗаписи);
	
	Результат.Обработано = Истина;
КонецПроцедуры

// Загружает информацию о несоответствии сведений о застрахованном лице в базу данных.
Процедура ЗагрузитьСообщение88(Страхователь, ИдентификаторСообщения, ТекстXML, Результат, Кэш) Экспорт
	// Примера нет, ожидаемые поля: snils, protocol[item[code,message,description]].
	// Поиск корневого узла.
	ОбъектXDTO = ОбъектXDTOПоСНИЛС(ТекстXML, Результат, ИдентификаторСообщения);
	Если ОбъектXDTO = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Чтение реквизитов.
	ДатаСообщения = СЭДОФСС.ДатаСообщения(ИдентификаторСообщения, Кэш);
	СНИЛСФСС      = СериализацияБЗК.СтроковыйРеквизитОбъекта(ОбъектXDTO, "snils");
	СНИЛС         = УчетПособийСоциальногоСтрахованияКлиентСервер.СНИЛСВФорматеИБ(СНИЛСФСС);
	Протокол      = СериализацияБЗК.СписокXDTO(ОбъектXDTO, "protocol.item");
	ПредставлениеПротокола = ПредставлениеПротокола(Протокол);
	ДоставкаИдентификатор = СериализацияБЗК.СтроковыйРеквизитОбъекта(ОбъектXDTO, "responseOn");
	
	// Поиск и создание документа.
	ТекстОшибки = "";
	Объект = СоздатьДокументПоСообщению(СНИЛС, Страхователь, ТекстОшибки, ДоставкаИдентификатор, ДатаСообщения, "Несоответствие", ИдентификаторСообщения);
	Если Объект = Неопределено Тогда
		Если ЗначениеЗаполнено(ТекстОшибки) Тогда
			СЭДОФСС.ОшибкаОбработки(Результат, ТекстОшибки);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	// Заполнение документа.
	Объект.НесоответствиеИдентификатор = ИдентификаторСообщения;
	Объект.НесоответствиеПротокол      = ПредставлениеПротокола;
	Объект.НесоответствиеДата          = ДатаСообщения;
	СЭДОФСС.ЗаписатьДокумент(Объект, Истина, "БЗК");
	
	Результат.Обработано = Истина;
КонецПроцедуры

// Находит корневой узел по имени вложенного узла "snils".
Функция ОбъектXDTOПоСНИЛС(ТекстXML, Результат, ИдентификаторСообщения)
	СтруктураDOM = СериализацияБЗК.СтруктураDOM(ТекстXML);
	ЭлементDOM = СериализацияБЗК.НайтиУзелDOM(СтруктураDOM, "//*[local-name() = 'snils']/..");
	Если ЭлементDOM = Неопределено Тогда
		СЭДОФСС.ЗаписатьОшибкуПоискаУзла(Результат, "snils");
		Возврат Неопределено;
	КонецЕсли;
	ФрагментXML = СериализацияБЗК.ОбъектDOMВСтрокуXML(ЭлементDOM);
	ОбъектXDTO  = СериализацияБЗК.ОбъектXDTOИзСтрокиXML(ФрагментXML);
	Возврат ОбъектXDTO;
КонецФункции

Функция ПредставлениеПротокола(Протокол)
	// Для сообщения 87 ожидаемые поля: mnemonic,level,text,description.
	// Для сообщения 88 ожидаемые поля: code,message,description.
	Если Протокол = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	МассивСтрок = Новый Массив;
	Для Каждого ЗаписьПротокола Из Протокол Цикл
		Тип         = СериализацияБЗК.СтроковыйРеквизитОбъекта(ЗаписьПротокола, "mnemonic");
		Код         = СериализацияБЗК.СтроковыйРеквизитОбъекта(ЗаписьПротокола, "code");
		УровеньАнгл = СериализацияБЗК.СтроковыйРеквизитОбъекта(ЗаписьПротокола, "level");
		Текст       = СериализацияБЗК.СтроковыйРеквизитОбъекта(ЗаписьПротокола, "text");
		Сообщение   = СериализацияБЗК.СтроковыйРеквизитОбъекта(ЗаписьПротокола, "message");
		Подробности = СериализацияБЗК.СтроковыйРеквизитОбъекта(ЗаписьПротокола, "description");
		// Все данные будут записываться в переменную Текст.
		Если ЗначениеЗаполнено(Текст) Тогда
			Массив = СтрРазделить(Текст, Символы.ПС + Символы.ВК, Ложь);
			Текст = СтрСоединить(Массив, Символы.ПС + "  ");
		КонецЕсли;
		Если ЗначениеЗаполнено(Сообщение) Тогда
			Массив = СтрРазделить(Сообщение, Символы.ПС + Символы.ВК, Ложь);
			Сообщение = СтрСоединить(Массив, Символы.ПС + "  ");
			Текст = ?(ЗначениеЗаполнено(Текст), Текст + Символы.ПС + "  " + Сообщение, Сообщение);
		КонецЕсли;
		Если ЗначениеЗаполнено(Подробности) Тогда
			Массив = СтрРазделить(Подробности, Символы.ПС + Символы.ВК, Ложь);
			Подробности = СтрСоединить(Массив, Символы.ПС + "    ");
			Текст = ?(ЗначениеЗаполнено(Текст), Текст + Символы.ПС + "    " + Подробности, Подробности);
		КонецЕсли;
		Если ЗначениеЗаполнено(Тип) Тогда
			Текст = СокрП(Тип + ": " + Текст);
		КонецЕсли;
		Если ЗначениеЗаполнено(Код) Тогда
			Текст = СокрП(Код + ": " + Текст);
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Текст) Тогда
			Продолжить;
		КонецЕсли;
		Если ЗначениеЗаполнено(УровеньАнгл) Тогда
			Если СтрСравнить(УровеньАнгл, "INFO") = 0 Тогда
				Уровень = Строка(УровеньЖурналаРегистрации.Информация);
			ИначеЕсли СтрСравнить(УровеньАнгл, "WARN") = 0 Тогда
				Уровень = Строка(УровеньЖурналаРегистрации.Предупреждение);
			ИначеЕсли СтрСравнить(УровеньАнгл, "ERR") = 0 Тогда
				Уровень = Строка(УровеньЖурналаРегистрации.Ошибка);
			Иначе
				Уровень = УровеньАнгл;
			КонецЕсли;
			Текст = "[" + Уровень + "] " + Текст;
		КонецЕсли;
		МассивСтрок.Добавить(Текст);
	КонецЦикла;
	
	Возврат СтрСоединить(МассивСтрок, Символы.ПС);
КонецФункции

Функция СведенияОСтатусеРегистрации(Статус)
	Результат = Новый Структура("Приоритет, Зарегистрирован, Расшифровка");
	
	СтатусВРег = ВРег(СокрЛП(Статус));
	
	// Статусы из актуальной спецификации.
	Если СтатусВРег = "RECEIVED" Тогда
		Результат.Приоритет       = 1;
		Результат.Зарегистрирован = Ложь;
		Результат.Расшифровка     = НСтр("ru = 'Началась регистрация карточки застрахованного лица'");
		
	ИначеЕсли СтатусВРег = "ERROR" Тогда
		Результат.Приоритет       = 2;
		Результат.Зарегистрирован = Ложь;
		Результат.Расшифровка     = НСтр("ru = 'Регистрация отклонена, выявлены ошибки не позволяющие зарегистрировать карточку застрахованного лица'");
		
	ИначеЕсли СтатусВРег = "PROCESSED" Тогда
		Результат.Приоритет       = 3;
		Результат.Зарегистрирован = Истина;
		Результат.Расшифровка     = НСтр("ru = 'Карточка застрахованного лица успешно зарегистрирована'");
	
	// Статусы из первых версий спецификации.
	ИначеЕсли СтатусВРег = "INVALIDATE" Тогда
		Результат.Приоритет       = 2;
		Результат.Зарегистрирован = Ложь;
		Результат.Расшифровка     = НСтр("ru = 'Карточка застрахованного лица не актуальна'");
		
	ИначеЕсли СтатусВРег = "REGISTRED" Тогда
		Результат.Приоритет       = 3;
		Результат.Зарегистрирован = Истина;
		Результат.Расшифровка     = НСтр("ru = 'Карточка застрахованного лица принята'");
		
	Иначе
		Результат.Приоритет       = 0;
		Результат.Зарегистрирован = Ложь;
		Результат.Расшифровка     = "";
		
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция СоздатьДокументПоСообщению(СНИЛС, Страхователь, ТекстОшибки, ДоставкаИдентификатор, ДатаСообщения, ПрефиксПоля, Идентификатор)
	// Проверка СНИЛС.
	Если Не ЗначениеЗаполнено(СНИЛС) Тогда
		ТекстОшибки = НСтр("ru = 'В xml-документе пустой узел ""snils"".'");
		Возврат Неопределено;
	КонецЕсли;
	
	// Поиск документа по идентификатору или физическому лицу.
	ДокументОснование = Неопределено;
	Объект = Неопределено;
	Ссылка = НайтиПоРеквизиту(ПрефиксПоля + "Идентификатор", Идентификатор);
	Если Не ЗначениеЗаполнено(Ссылка) И ЗначениеЗаполнено(ДоставкаИдентификатор) Тогда
		Ссылка = НайтиПоРеквизиту("ДоставкаИдентификатор", ДоставкаИдентификатор);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		ГоловнаяОрганизация = ЗарплатаКадры.ГоловнаяОрганизация(Страхователь);
		// Поиск физического лица по СНИЛС.
		РезультатПоиска = ФизическиеЛицаЗарплатаКадры.ФизическоеЛицоПоСНИЛСИлиФИО(СНИЛС, "", "", "");
		ФизическоеЛицо = РезультатПоиска.ФизическоеЛицо;
		Если Не ЗначениеЗаполнено(ФизическоеЛицо) Тогда
			ТекстОшибки = РезультатПоиска.ТекстОшибки;
			Возврат Неопределено;
		КонецЕсли;
		// Поиск последней регистрации по физическому лицу и головной организации.
		Регистр = СведенияОРегистрацииИзРегистра(ФизическоеЛицо, ГоловнаяОрганизация);
		ДокументОснование = Регистр.ОтправленныеСведения;
		Если ЗначениеЗаполнено(Регистр.РегистрацияСведений)
			И Не ЗначениеЗаполнено(Регистр[ПрефиксПоля + "Идентификатор"]) Тогда
			Ссылка = Регистр.РегистрацияСведений;
		КонецЕсли;
		// Проверка результата и сбор информации для регистрации ошибки.
		Если Не ЗначениеЗаполнено(Ссылка) Тогда
			Условия = Новый Массив;
			Условия.Добавить(СтрШаблон("""%1"" = ""%2""", ПрефиксПоля + "Идентификатор", Идентификатор));
			Если ЗначениеЗаполнено(ДоставкаИдентификатор) Тогда
				Условия.Добавить(СтрШаблон("""%1"" = ""%2""", "ДоставкаИдентификатор", ДоставкаИдентификатор));
			КонецЕсли;
			Условие = НСтр("ru = '""Физическое лицо"" = ""%1"" и ""Головная организация"" = ""%2""'");
			Условия.Добавить(СтрШаблон(Условие, ФизическоеЛицо, ГоловнаяОрганизация));
			ТекстУсловий = "  * " + СтрСоединить(Условия, ";" + Символы.ПС + "  * ");
			ТекстОшибки = НСтр("ru = 'Не найдена регистрация сведений о застрахованном лице по условиям %1.'");
			ТекстОшибки = СтрШаблон(ТекстОшибки, Символы.ПС + ТекстУсловий);
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	// Заполнение документа.
	Объект = Ссылка.ПолучитьОбъект();
	
	// Если идентификатор доставки совпадает, то проверки дат не требуются.
	Если ЗначениеЗаполнено(ДоставкаИдентификатор)
		И Объект.ДоставкаИдентификатор = ДоставкаИдентификатор Тогда
		Возврат Объект;
	КонецЕсли;
	
	// Исключение затирания ранними сообщениями актуальной информации.
	Если ЗначениеЗаполнено(Объект[ПрефиксПоля + "Идентификатор"])
		И Объект[ПрефиксПоля + "Идентификатор"] <> Идентификатор
		И Объект[ПрефиксПоля + "Дата"] > ДатаСообщения Тогда
		ТекстЖурнала = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Сообщение СЭДО %1 от %2 не повлияло на учет отправленных сведений, поскольку в программу уже загружено более позднее сообщение %3 от %4. СНИЛС физического лица: %5, Страхователь: %6.'"),
			Идентификатор,
			ДатаСообщения,
			Объект[ПрефиксПоля + "Идентификатор"],
			Объект[ПрефиксПоля + "Дата"],
			СНИЛС,
			Страхователь);
		ЗаписьЖурналаРегистрации(
			СЭДОФСС.ИмяСобытияЖурнала(),
			УровеньЖурналаРегистрации.Предупреждение,
			Объект.Метаданные(),
			Ссылка,
			ТекстЖурнала);
		Возврат Неопределено;
	КонецЕсли;
	Если НачалоДня(Объект.ДатаОтправки) > ДатаСообщения Тогда
		ТекстЖурнала = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Сообщение СЭДО %1 от %2 не повлияло на учет отправленных сведений, поскольку из программы позже (%3) отправлены новые сведения. СНИЛС физического лица: %4, Страхователь: %5.'"),
			Идентификатор,
			ДатаСообщения,
			Объект.ДатаОтправки,
			СНИЛС,
			Страхователь);
		ЗаписьЖурналаРегистрации(
			СЭДОФСС.ИмяСобытияЖурнала(),
			УровеньЖурналаРегистрации.Предупреждение,
			Объект.Метаданные(),
			Ссылка,
			ТекстЖурнала);
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Объект;
КонецФункции

Функция СведенияОРегистрацииИзРегистра(ФизическоеЛицо, ГоловнаяОрганизация)
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗастрахованныеЛицаСЭДО.РегистрацияСведений КАК РегистрацияСведений,
	|	РегистрацияСведенийОЗастрахованномЛицеФСС.ДоставкаИдентификатор КАК ДоставкаИдентификатор,
	|	РегистрацияСведенийОЗастрахованномЛицеФСС.РегистрацияИдентификатор КАК РегистрацияИдентификатор,
	|	РегистрацияСведенийОЗастрахованномЛицеФСС.НесоответствиеИдентификатор КАК НесоответствиеИдентификатор,
	|	ЗастрахованныеЛицаСЭДО.ОтправленныеСведения КАК ОтправленныеСведения
	|ИЗ
	|	РегистрСведений.ЗастрахованныеЛицаСЭДО КАК ЗастрахованныеЛицаСЭДО
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РегистрацияСведенийОЗастрахованномЛицеФСС КАК РегистрацияСведенийОЗастрахованномЛицеФСС
	|		ПО ЗастрахованныеЛицаСЭДО.РегистрацияСведений = РегистрацияСведенийОЗастрахованномЛицеФСС.Ссылка
	|ГДЕ
	|	ЗастрахованныеЛицаСЭДО.ФизическоеЛицо = &ФизическоеЛицо
	|	И ЗастрахованныеЛицаСЭДО.ГоловнаяОрганизация = &ГоловнаяОрганизация";
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
	Запрос.УстановитьПараметр("ГоловнаяОрганизация", ГоловнаяОрганизация);
	
	Таблица = Запрос.Выполнить().Выгрузить();
	Если Таблица.Количество() = 0 Тогда
		Таблица.Добавить();
	КонецЕсли;
	Возврат Таблица[0];
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
